TrevorCD/FreeRTOS-STM32F446RE-GCC/src/main.c
/* The period at which the check timer will expire, in ms, if an error has been
 * reported in one of the standard demo tasks.  ms are converted to the
 * equivalent in ticks using the portTICK_PERIOD_MS constant. */
#define mainERROR_CHECK_TIMER_PERIOD_MS          ( 200UL / portTICK_PERIOD_MS )

/* Set mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY to 1 to create a simple demo.
 * Set mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY to 0 to create a much more
 * comprehensive test application.  See the comments at the top of this file,
 * and the documentation page on the http://www.FreeRTOS.org web site for more
 * information. */
#define mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY    0

/*-----------------------------------------------------------*/

/*
 * Set up the hardware ready to run this demo.
 */
static void prvSetupHardware( void );

/*
 * The check timer callback function, as described at the top of this file.
 */
static void prvCheckTimerCallback( TimerHandle_t xTimer );

/*
 * Configure the interrupts used to test the interrupt nesting depth as
 * described at the top of this file.
 */
static void prvSetupNestedFPUInterruptsTest( void );

/*
 * Register check tasks, and the tasks used to write over and check the contents
 * of the FPU registers, as described at the top of this file.  The nature of
 * these files necessitates that they are written in an assembly file.
 */
extern void vRegTest1Task( void * pvParameters );
extern void vRegTest2Task( void * pvParameters );
extern void vRegTestClearFlopRegistersToParameterValue( unsigned long ulValue );
extern unsigned long ulRegTestCheckFlopRegistersContainParameterValue( unsigned long ulValue );

/*
 * The task that is synchronised with the button interrupt.  This is done just
 * to demonstrate how to write interrupt service routines, and how to
 * synchronise a task with an interrupt.
 */
static void prvButtonTestTask( void * pvParameters );

/*
 * This file can be used to create either a simple LED flasher example, or a
 * comprehensive test/demo application - depending on the setting of the
 * mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY constant defined above.  If
 * mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY is set to 1, then the following
 * function will create a lot of additional tasks and a software timer.  If
 * mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY is set to 0, then the following
 * function will do nothing.
 */
static void prvOptionallyCreateComprehensveTestApplication( void );

/*
 * Private function prototypes for System Clock init
 */
static void SystemClock_Config(void);
static void Error_Handler(void);

/*-----------------------------------------------------------*/

/* The following two variables are used to communicate the status of the
 * register check tasks to the check software timer.  If the variables keep
 * incrementing, then the register check tasks have not discovered any errors.
 * If a variable stops incrementing, then an error has been found. */
volatile unsigned long ulRegTest1LoopCounter = 0UL, ulRegTest2LoopCounter = 0UL;

/* The following variables are used to verify that the interrupt nesting depth
 * is as intended.  ulFPUInterruptNesting is incremented on entry to an interrupt
 * that uses the FPU, and decremented on exit of the same interrupt.
 * ulMaxFPUInterruptNesting latches the highest value reached by
 * ulFPUInterruptNesting.  These variables have no other purpose. */
volatile unsigned long ulFPUInterruptNesting = 0UL, ulMaxFPUInterruptNesting = 0UL;

/* The semaphore used to demonstrate a task being synchronised with an
 * interrupt. */
static SemaphoreHandle_t xTestSemaphore = NULL;

/* The variable that is incremented by the task synchronised with the button
 * interrupt. */
volatile unsigned long ulButtonPressCounts = 0UL;

/*-----------------------------------------------------------*/

int main( void )
{
    /* Configure the hardware ready to run the test. */
    prvSetupHardware();

    /* Start standard demo/test application flash tasks.  See the comments at
     * the top of this file.  The LED flash tasks is created when
	 * mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY is set to 1.  The other tasks are
	 * only created if mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY is set to 0
	 * (at the top of this file).  See the comments at the top of this file for
     * more information. */
#if mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY
    vStartLEDFlashTasks( mainFLASH_TASK_PRIORITY );
#endif
	
    /* The following function will only create more tasks and timers if
     * mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY is set to 0 (at the top of this
     * file).  See the comments at the top of this file for more information. */
    prvOptionallyCreateComprehensveTestApplication();

    /* Start the scheduler. */
    vTaskStartScheduler();

    /* If all is well, the scheduler will now be running, and the following line
     * will never be reached.  If the following line does execute, then there was
     * insufficient FreeRTOS heap memory available for the idle and/or timer tasks
     * to be created.  See the memory management section on the FreeRTOS web site
     * for more details. */
    for( ; ; )
    {
    }
}
/*-----------------------------------------------------------*/

static void prvCheckTimerCallback( TimerHandle_t xTimer )
{
    static long lChangedTimerPeriodAlready = pdFALSE;
    static unsigned long ulLastRegTest1Value = 0, ulLastRegTest2Value = 0;
    long lErrorFound = pdFALSE;

    /* Check all the demo tasks (other than the flash tasks) to ensure
     * that they are all still running, and that none have detected an error. */

    if( xAreMathsTaskStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xAreIntegerMathsTaskStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xAreDynamicPriorityTasksStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xAreBlockingQueuesStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xAreBlockTimeTestTasksStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xAreGenericQueueTasksStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xAreRecursiveMutexTasksStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

