TrevorCD/FreeRTOS-STM32F446RE-GCC/src/main.c
    if( xIsCreateTaskStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xArePollingQueuesStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    if( xAreSemaphoreTasksStillRunning() != pdTRUE )
    {
        lErrorFound = pdTRUE;
    }

    /* Check that the register test 1 task is still running. */
    if( ulLastRegTest1Value == ulRegTest1LoopCounter )
    {
        lErrorFound = pdTRUE;
    }

    ulLastRegTest1Value = ulRegTest1LoopCounter;

    /* Check that the register test 2 task is still running. */
    if( ulLastRegTest2Value == ulRegTest2LoopCounter )
    {
        lErrorFound = pdTRUE;
    }

    ulLastRegTest2Value = ulRegTest2LoopCounter;

    /* Toggle the check LED to give an indication of the system status.  If
     * the LED toggles every mainCHECK_TIMER_PERIOD_MS milliseconds then
     * everything is ok.  A faster toggle indicates an error. */
    vParTestToggleLED( mainCHECK_LED );

    /* Have any errors been latch in lErrorFound?  If so, shorten the
     * period of the check timer to mainERROR_CHECK_TIMER_PERIOD_MS milliseconds.
     * This will result in an increase in the rate at which mainCHECK_LED
     * toggles. */
    if( lErrorFound != pdFALSE )
    {
        if( lChangedTimerPeriodAlready == pdFALSE )
        {
            lChangedTimerPeriodAlready = pdTRUE;

            /* This call to xTimerChangePeriod() uses a zero block time.
             * Functions called from inside of a timer callback function must
             * never* attempt	to block. */
            xTimerChangePeriod( xTimer, ( mainERROR_CHECK_TIMER_PERIOD_MS ),
								mainDONT_BLOCK );
        }
    }
}
/*-----------------------------------------------------------*/

static void prvButtonTestTask( void * pvParameters )
{
    configASSERT( xTestSemaphore );

    /* This is the task used as an example of how to synchronise a task with
     * an interrupt.  Each time the button interrupt gives the semaphore, this task
     * will unblock, increment its execution counter, then return to block
     * again. */

    /* Take the semaphore before started to ensure it is in the correct
     * state. */
    xSemaphoreTake( xTestSemaphore, mainDONT_BLOCK );

    for( ; ; )
    {
        xSemaphoreTake( xTestSemaphore, portMAX_DELAY );
        ulButtonPressCounts++;
    }
}
/*-----------------------------------------------------------*/

static void prvSetupHardware( void )
{
    /* Setup STM32 system (clock, PLL and Flash configuration) */
    //SystemInit(); called by startup_stm32f4xx.s
	HAL_Init();
	SystemClock_Config();
	
    /* Ensure all priority bits are assigned as preemption priority bits. */
    NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_4 );

    /* Setup the LED outputs. */
    vParTestInitialise();

    /* Configure the button input.  This configures the interrupt to use the
     * lowest interrupt priority, so it is ok to use the ISR safe FreeRTOS API
     * from the button interrupt handler. */
	BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

}
/*-----------------------------------------------------------*/

void vApplicationTickHook( void )
{
    #if ( mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY == 0 )
    {
        /* Just to verify that the interrupt nesting behaves as expected,
         * increment ulFPUInterruptNesting on entry, and decrement it on exit. */
        ulFPUInterruptNesting++;

        /* Fill the FPU registers with 0. */
        vRegTestClearFlopRegistersToParameterValue( 0UL );

        /* Trigger a timer 2 interrupt, which will fill the registers with a
         * different value and itself trigger a timer 3 interrupt.  Note that the
         * timers are not actually used.  The timer 2 and 3 interrupt vectors are
         * just used for convenience. */
        NVIC_SetPendingIRQ( TIM2_IRQn );

        /* Ensure that, after returning from the nested interrupts, all the FPU
         * registers contain the value to which they were set by the tick hook
         * function. */
        configASSERT( ulRegTestCheckFlopRegistersContainParameterValue( 0UL ) );

        ulFPUInterruptNesting--;
    }
    #endif /* if ( mainCREATE_SIMPLE_LED_FLASHER_DEMO_ONLY == 0 ) */
}
/*-----------------------------------------------------------*/

static void prvSetupNestedFPUInterruptsTest( void )
{
	// outdated iterrupt struct
    //NVIC_InitTypeDef NVIC_InitStructure;

    /* Enable the TIM2 interrupt in the NVIC.  The timer itself is not used,
     * just its interrupt vector to force nesting from software.  TIM2 must have
     * a lower priority than TIM3, and both must have priorities above
     * configMAX_SYSCALL_INTERRUPT_PRIORITY. */
	HAL_NVIC_SetPriority(TIM2_IRQn,
						 configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY -1,
						 0);
	HAL_NVIC_EnableIRQ(TIM2_IRQn);

	/* Outdated TIM2 NVIC Init
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY - 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init( &NVIC_InitStructure );
	*/
	
    /* Enable the TIM3 interrupt in the NVIC.  The timer itself is not used,
     * just its interrupt vector to force nesting from software.  TIM2 must have
     * a lower priority than TIM3, and both must have priorities above
     * configMAX_SYSCALL_INTERRUPT_PRIORITY. */
	HAL_NVIC_SetPriority(TIM3_IRQn,
						 configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY -2,
						 0);
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
	
	/* Outdated TIM3 NVIC Init
    NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY - 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init( &NVIC_InitStructure );
	*/
}
/*-----------------------------------------------------------*/

void TIM3_IRQHandler( void )
{
    /* Just to verify that the interrupt nesting behaves as expected, increment
     * ulFPUInterruptNesting on entry, and decrement it on exit. */
    ulFPUInterruptNesting++;

    /* This is the highest priority interrupt in the chain of forced nesting
     * interrupts, so latch the maximum value reached by ulFPUInterruptNesting.
     * This is done purely to allow verification that the nesting depth reaches
     * that intended. */
    if( ulFPUInterruptNesting > ulMaxFPUInterruptNesting )
    {
        ulMaxFPUInterruptNesting = ulFPUInterruptNesting;
    }

